tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "osrf/simulation"
brew "age"
brew "argp-standalone"
brew "argtable"
brew "argtable3"
brew "openssl@3"
brew "asio"
brew "astroterm"
brew "readline"
brew "autojump"
brew "automake"
brew "bison"
brew "bloaty"
brew "ghc"
brew "cabal-install"
brew "glib"
brew "chruby"
brew "clang-format"
brew "cloc"
brew "libyaml"
brew "cookiecutter"
brew "pcre"
brew "tinyxml2"
brew "cppcheck"
brew "eigen"
brew "pkgconf"
brew "sdl2"
brew "harfbuzz"
brew "node"
brew "emscripten"
brew "python@3.12"
brew "tesseract"
brew "ffmpeg"
brew "gcovr"
brew "gdbm"
brew "gh"
brew "go"
brew "htmldoc"
brew "icu4c@76"
brew "libheif"
brew "imagemagick"
brew "iproute2mac"
brew "keyring"
brew "libffi"
brew "libraqm"
brew "libxrandr"
brew "lsusb"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "meson"
brew "ncurses"
brew "neovim"
brew "ocaml"
brew "opam"
brew "pandoc"
brew "pillow"
brew "pipx"
brew "poco"
brew "pstree"
brew "python-matplotlib"
brew "tcl-tk"
brew "python-tk@3.13"
brew "ripgrep"
brew "ruby"
brew "ruby-install"
brew "rust"
brew "rustup"
brew "sdl2_image"
brew "sdl2_ttf"
brew "sloc"
brew "starship"
brew "stow"
brew "tinyxml", link: false
brew "tree"
brew "twine"
brew "vite"
brew "wget"
brew "jakehilborn/jakehilborn/displayplacer"
brew "koekeishiya/formulae/yabai"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "arduino-ide"
cask "bitwarden"
cask "discord"
cask "iterm2"
cask "obsidian"
cask "spotify"
cask "todoist"
