tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "osrf/simulation"
brew "age"
brew "argp-standalone"
brew "argtable"
brew "argtable3"
brew "openssl@3"
brew "asio"
brew "astroterm"
brew "readline"
brew "autojump"
brew "automake"
brew "bison"
brew "bloaty"
brew "ghc"
brew "cabal-install"
brew "glib"
brew "chruby"
brew "clang-format"
brew "cloc"
brew "libyaml"
brew "cookiecutter"
brew "pcre"
brew "tinyxml2"
brew "cppcheck"
brew "eigen"
brew "pkgconf"
brew "sdl2"
brew "dartsim"
brew "harfbuzz"
brew "node"
brew "emscripten"
brew "python@3.12"
brew "tesseract"
brew "ffmpeg"
brew "gcovr"
brew "gdbm"
brew "gh"
brew "go"
brew "htmldoc"
brew "icu4c@76"
brew "libheif"
brew "imagemagick"
brew "iproute2mac"
brew "keyring"
brew "libffi"
brew "libraqm"
brew "libxrandr"
brew "lsusb"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "meson"
brew "ncurses"
brew "neovim"
brew "ocaml"
brew "opam"
brew "pandoc"
brew "pillow"
brew "pipx"
brew "poco"
brew "pstree"
brew "python-matplotlib"
brew "tcl-tk"
brew "python-tk@3.13"
brew "ripgrep"
brew "ruby"
brew "ruby-install"
brew "rust"
brew "rustup"
brew "sdl2_image"
brew "sdl2_ttf"
brew "sloc"
brew "starship"
brew "stow"
brew "tinyxml", link: false
brew "tree"
brew "twine"
brew "vite"
brew "wget"
brew "zig"
brew "jakehilborn/jakehilborn/displayplacer"
brew "koekeishiya/formulae/yabai"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "arduino-ide"
cask "bitwarden"
cask "discord"
cask "docker"
cask "firefox@developer-edition"
cask "fl-studio"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "ltspice"
cask "mactex"
cask "mark-text"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "multipass"
cask "obsidian"
cask "slack"
cask "spotify"
cask "todoist"
cask "visual-studio-code"
cask "vitalsource-bookshelf"
cask "wezterm"
cask "wireshark"
cask "xquartz"
vscode "1yib.rust-bundle"
vscode "4a454646.github-purple"
vscode "adamjkb.atom-font-icons"
vscode "aedit.ugly-like-me"
vscode "ahmadawais.shades-of-purple"
vscode "alexanderalekseenko.darky-purple-theme"
vscode "alexdauenhauer.nocterial-palenight"
vscode "alexesprit.vscode-unfancy-file-icons"
vscode "amatiasq.sort-imports"
vscode "anaganisk.theme-onedark-plus"
vscode "andrsdc.base16-themes"
vscode "antfu.icons-carbon"
vscode "apvarun.celestial"
vscode "artlaman.chalice-icon-theme"
vscode "arzg.icefall"
vscode "atomiks.moonlight"
vscode "bbenoist.nix"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "bierner.markdown-preview-github-styles"
vscode "catppuccin.catppuccin-vsc"
vscode "cdonohue.quill-icons"
vscode "clowzed.none"
vscode "cocopon.iceberg-theme"
vscode "codealb.codealb"
vscode "compulim.vscode-clock"
vscode "cschlosser.doxdocgen"
vscode "damc.textpad-icon-theme"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "davidanson.vscode-markdownlint"
vscode "davidbabel.vscode-simpler-icons"
vscode "dbanksdesign.nu-disco"
vscode "ddl-vscode.ddl"
vscode "docker.docker"
vscode "drewxs.tokyo-night-dark"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "edonet.vscode-command-runner"
vscode "elanandkumar.el-vsc-product-icon-theme"
vscode "emroussel.atom-icons"
vscode "emroussel.atomize-atom-one-dark-theme"
vscode "enenumxela.signed-dark-pro"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "excalith.atomized-theme"
vscode "file-icons.file-icons"
vscode "fill-labs.dependi"
vscode "fisheva.eva-theme"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "gracefulpotato.gruvbox-ish"
vscode "grantbachman.challenger-deep-theme"
vscode "harg.iceberg"
vscode "haskell.haskell"
vscode "helgardrichard.helium-icon-theme"
vscode "huytd.tokyo-city"
vscode "james-yu.latex-workshop"
vscode "janetracymuthoni.nairobi-night"
vscode "janisdd.vscode-edit-csv"
vscode "jbenden.c-cpp-flylint"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "josetr.cmake-language-support-vscode"
vscode "justusadam.language-haskell"
vscode "kamikillerto.vscode-colorize"
vscode "kast789.atom-ide-ui"
vscode "keenethics.keen-neutral-icon-theme"
vscode "kevinglasson.cornflakes-linter"
vscode "kevinrose.vsc-python-indent"
vscode "koalamer.workspace-in-status-bar"
vscode "konradkeska.subliminal-next"
vscode "leevashan.statusbarlabel"
vscode "liviuschera.noctis"
vscode "maiquitome.elixir-theme"
vscode "marqu3s.aurora-x"
vscode "marus25.cortex-debug"
vscode "matangover.mypy"
vscode "mathematic.vscode-latex"
vscode "matiasolivera.universe"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mechatroner.rainbow-csv"
vscode "mervin.markdown-formatter"
vscode "mesonbuild.mesonbuild"
vscode "miguelsolorio.fluent-icons"
vscode "mitaki28.vscode-clang"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mradbourne.theme-base16-ocean-deep"
vscode "mrpbennett.atlantic-night"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "nataliefruitema.modern-purple-theme"
vscode "ocamllabs.ocaml-platform"
vscode "paulober.pico-w-go"
vscode "photonsh.vscode-photon-theme"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "pokowaka.pokowaka-iwyu"
vscode "qinjia.seti-icons"
vscode "rafapaulin.try-material-icon-theme"
vscode "raspberry-pi.raspberry-pi-pico"
vscode "rastikerdar.vscode-seedling-icon-theme"
vscode "redhat.java"
vscode "remcoros.startanyshell"
vscode "riipandi.vscode-atomizer-theme"
vscode "rithikdev.neon-blue-drive"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.atom-ide-dark"
vscode "s-nlf-fh.glassit"
vscode "sainnhe.everforest"
vscode "sainnhe.gruvbox-material"
vscode "samrapdev.outrun"
vscode "sdras.inbedby7pm"
vscode "sdras.night-owl"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sldobri.nord-5-stars"
vscode "snndmnsz.dark-side-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "sujan.code-blue"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "takumii.markdowntable"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "themartes.gooeytheme"
vscode "thomaz.preparing"
vscode "twopill.deepspace"
vscode "twxs.cmake"
vscode "tyriar.theme-sapphire"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wart.ariake-dark"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "willi84.vikings-icon-theme"
vscode "yummygum.city-lights-icon-vsc"
vscode "yummygum.city-lights-theme"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
