# Development Tools & Languages
brew "python@3.12"
brew "python-matplotlib"
brew "python-tk@3.13"
brew "pipx"
brew "ruby"
brew "ruby-install"
brew "rust"
brew "rustup"
brew "go"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "ocaml"
brew "opam"
brew "node"

# Build tools
brew "make"
brew "meson"
brew "pkgconf"
brew "clang-format"

# Code analysis
brew "cppcheck"
brew "cloc"
brew "sloc"
brew "gcovr"

# Text Editors & Terminal
brew "neovim"
brew "starship"
cask "alacritty"
cask "iterm2"

# Development Tools (GUI)
cask "arduino-ide"

# CLI Utilities
brew "astroterm"
brew "stow"
brew "tree"
brew "age"
brew "wget"
brew "ripgrep"
brew "fzf"
brew "autojump"
brew "pstree"
brew "lsusb"
brew "iproute2mac"

# Document Processing
brew "pandoc"

# Web Development
brew "vite"

# Applications
cask "adobe-acrobat-reader"
cask "bitwarden"
cask "obsidian"
cask "spotify"
cask "todoist"
